{
  "2025-07-28": [
    {
      "source": "https://careersatagoda.com/job/6161339-lead-software-engineer-front-end-bangkok-based-relocation-provided/",
      "companyName": "Agoda",
      "jobDesc": "Lead Software Engineer - Front End (Bangkok based, Relocation provided). Lead design and development of large-scale front-end applications. Drive collaboration with product managers and engineers. Provide technical guidance and mentorship. Develop proof of concepts and evaluate new technologies. Implement strategic technical decisions. Optimize application performance. Maintain coding standards. Requirements: 10+ years of software development experience, Minimum 3 years in a Tech Lead role, Extensive experience with client-side technologies (JavaScript, TypeScript, React), Strong skills in front-end system design and performance optimization, Experience mentoring senior and staff engineers, Ability to provide technical direction across teams. Company Overview: Agoda is an online travel booking platform with 7,100+ employees representing 95+ nationalities. Full relocation support provided.",
      "location": "Bangkok, Thailand",
      "email": null
    },
    {
      "source": "https://careersatagoda.com/job/6161341-staff-software-engineer-front-end-bangkok-based-relocation-provided/",
      "companyName": "Agoda",
      "jobDesc": "Staff Software Engineer - Front End (Bangkok based, Relocation provided). Join a high-energy, international team driving innovation across regions. Work in a tech-centric city with a thriving expat community. Visionary Front-End architect to lead front end transformation and drive seamless experiences for millions of users. Work and collaborate in English—no Thai required! World-class relocation and family support. Build, design, and optimize user interfaces, engaging users with visually appealing and highly functional web applications. Work closely with cross-functional teams. Focus on accommodations, flights, and payments products.",
      "location": "Bangkok, Thailand",
      "email": null
    },
    {
      "source": "https://careers.linecorp.com/jobs/190",
      "companyName": "LINE Bank Taiwan",
      "jobDesc": "Front-end Developer. Analyze and develop web services. Optimize web app experience. Collaborate with product managers, designers, and engineers. Formulate API connection rules. Provide user behavior data for analysis. Optimize UI/UX response speed. Write system design documents. Basic Qualifications: 5+ years of relevant work experience, University degree or higher, Proficient in JavaScript (ES6+), HTML, CSS, RWD, Git, Understanding of RESTful API and network security, Good English communication skills, CI/CD and DevOps experience. Preferred: Experience with ReactJS, Familiarity with Jest testing framework, Webpack development tools.",
      "location": "Taipei, Taiwan",
      "email": null
    },
    {
      "source": "https://sevenpeakssoftware.com/career/frontend-developer-jobs/",
      "companyName": "Seven Peaks Software",
      "jobDesc": "Tech Lead Web and Senior Web Developer (React) positions available. Modern frontend development using the latest and most popular web frameworks, React JS and Angular. International, multicultural team with 200+ professionals from 35+ countries. Benefits include: 10-15 days paid vacation, Flexible working hours, Health and life insurance, Central Bangkok office location, Team trips, Free lunches and snacks. Working with clients including SCB, UOB, RHB banks.",
      "location": "Bangkok, Thailand",
      "email": "sales@sevenpeakssoftware.com"
    },
    {
      "source": "https://www.bangkokbank.com/en/About-Us/Bangkok-Bank-Careers",
      "companyName": "Bangkok Bank",
      "jobDesc": "Looking for technology careers in high-paying positions. Technology is changing every day and Bangkok Bank is determined to be at the forefront of these changes. All employees are given opportunities to learn how to grow professionally in their careers. Applied technology to enhance learning efficiency including e-Learning, mobile application and virtual classroom. Tech talent sought to join innovation initiatives. Check Bualuang iCareer platform for specific frontend developer positions.",
      "location": "Bangkok, Thailand",
      "email": null
    },
    {
      "source": "https://remoteok.com/remote-react+typescript-jobs",
      "companyName": "Various Remote Companies",
      "jobDesc": "Remote React + TypeScript positions available with salaries ranging from $50,000/year to $140,000/year. Full Stack, PayPay Card, and GetCovered actively hiring. Positions support Asia time zones. Required skills: React and TypeScript libraries expertise, JavaScript, Node.js, Redux for state management. Many positions offer full remote work from Bangkok while earning international salaries. Contract-to-hire positions available $80,000-$95,000 per year.",
      "location": "Remote",
      "email": null
    },
    {
      "source": "https://th.jobsdb.com/front-end-developer-jobs",
      "companyName": "Multiple Companies via JobsDB",
      "jobDesc": "469 Front End Developer jobs found in Thailand with new jobs added daily. 107 Front End React Developer positions. Common requirements: At least 7 years experience as Frontend Developer, Familiar with ReactJs and NodeJs, Minimum 5 years experience in front-end development, Proficiency in HTML5, CSS3, JavaScript, and TypeScript. Salary ranges: Mid-level ฿27,000-฿40,000/month, Senior level ฿30,000-฿40,000/month. Companies include Bluebik (leading consultancy), Binance (blockchain positions).",
      "location": "Bangkok, Thailand",
      "email": null
    }
  ]
}